package com.anton_kulakov.entity;

public class Employer extends Person {
    // 👨‍💼

    public Employer(int speed, int hp) {
        super(speed, hp);
    }

    @Override
    void makeMove() {
        // Стремятся найти ресурс (деньги венчурного фонда).
        // Может потратить свой ход на движение в сторону денег, либо на их поглощение

        // Количество HP работодателя уменьшается от отсутствия денег и от атак джуниоров
        // Если значение HP работодателя опускается до 0 при отсутствии денег и атак джуниоров, то работодатель исчезает

    }
}
